app/views/book_orders/show.html.haml

SELECT "book_cards".* FROM "book_cards" WHERE "book_cards"."book_order_id" = ?  [["book_order_id", 1]]
---
                %tbody
                    - @book_order.book_cards.each do |book_card|