app/views/books/destroy.js.erb

$('.destroy-book').bind('ajax:success', function() {
   $(this).closest('tr').fadeOut();
});
---
DELETE FROM "books" WHERE "books"."id" = ?  [["id", 14]]