app/controllers/books_controller.rb

INSERT INTO "books" ("isbn", "name", "desc", "author", "created_at", "updated_at", "category_id") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @book = Book.new(book_params)

    # render plain: params[:book].inspect
    respond_to do |format|
      if @book.save

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def load_book
    @book = Book.find(params[:id])