app/controllers/book_orders_controller.rb

SELECT "book_orders".* FROM "book_orders"
---
  def index
    @book_orders_grid = BookOrdersGrid.new(params[:book_orders_grid]) do |scope|
      scope.page(params[:page])
    end
    @book_orders = BookOrder.all

SELECT  "book_orders".* FROM "book_orders" WHERE "book_orders"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @book_order = BookOrder.find(params[:id])

INSERT INTO "book_orders" ("amount_book", "brorrow_date", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["amount_book", 2], ["brorrow_date", "2020-02-18"], ["created_at", "2020-02-18 04:03:44.198504"], ["updated_at", "2020-02-18 04:03:44.198504"], ["user_id", 4]]
---
  def create
    @book_order = BookOrder.new(book_order_params)
    respond_to do |format|
      if @book_order.save

SELECT  "book_orders".* FROM "book_orders" WHERE "book_orders"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
  def load_book_order
    @book_order = BookOrder.find(params[:id])