app/controllers/book_cards_controller.rb

SELECT  "book_cards".* FROM "book_cards" LIMIT ? OFFSET ?  [["LIMIT", 25], ["OFFSET", 0]]
SELECT COUNT(*) FROM "book_cards"
---
  def index
    @book_cards_grid = BookCardsGrid.new(params[:book_cards_grid]) do |scope|
      scope.page(params[:page])
    end
    # binding.pry
    @book_cards = BookCard.all.page params[:page]

UPDATE "book_cards" SET "status" = ?, "updated_at" = ? WHERE "book_cards"."id" = ?  [["status", 1], ["updated_at", "2020-02-17 06:10:56.793869"], ["id", 4]]
---
  def update
    respond_to do |format|
      if @book_card.update(book_card_params)

SELECT  "book_cards".* FROM "book_cards" WHERE "book_cards"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def load_book_card
    @book_card = BookCard.find(params[:id])