app/controllers/book_cards_controller.rb

SELECT  "book_cards".* FROM "book_cards" WHERE "book_cards"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def show
    @book_card = BookCard.find(params[:id])

SELECT  "book_cards".* FROM "book_cards" WHERE "book_cards"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def edit
    @book_card = BookCard.find(params[:id])

SELECT  "book_cards".* FROM "book_cards" WHERE "book_cards"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def update
    @book_card = BookCard.find(params[:id])