app/controllers/categories_controller.rb

  def update

    if @category.update(category_params)
---
UPDATE "categories" SET "name" = ?, "updated_at" = ? WHERE "categories"."id" = ?  [["name", "Truyện trinh thám"], ["updated_at", "2020-02-11 04:51:44.687879"], ["id", 1]]

  def load_category
    @category = Category.find(params[:id])
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]