app/controllers/users_controller.rb

UPDATE "users" SET "image" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["image", "733F630E-BC2B-4260-8E00-4FC2EE70B6D2.jpeg"], ["updated_at", "2020-02-18 04:02:51.736996"], ["id", 4]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)