app/controllers/users_controller.rb

INSERT INTO "users" ("name", "birthday", "phone", "address", "image", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)
    # uploader = ImageUploader.new
    # uploader.store!(my_file) # size: 1024x768

    # user.url # => '/url/to/my_file.png'               # size: 800x800
    # uploader.thumb.url # => '/url/to/thumb_my_file.png'   # size: 200x200
    respond_to do |format|
      if @user.save

UPDATE "users" SET "image" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["image", "Oanh_01.jpg"], ["updated_at", "2020-02-11 09:23:14.404090"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)