app/models/book_order.rb

SELECT  "book_orders".* FROM "book_orders" ORDER BY "book_orders"."id" DESC LIMIT ?  [["LIMIT", 1]]
SELECT "books".* FROM "books"
SELECT "book_orders".* FROM "book_orders"
---
  def sum_deposits
    book_order = BookOrder.last
    sum = 0
    book_cards.each do |book_card|

SELECT  "book_orders".* FROM "book_orders" ORDER BY "book_orders"."id" DESC LIMIT ?  [["LIMIT", 1]]
UPDATE "books" SET "books_total" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["books_total", 615], ["updated_at", "2020-02-19 09:19:28.798021"], ["id", 2]]
UPDATE "book_orders" SET "deposits" = ? WHERE "book_orders"."id" = ?  [["deposits", 923], ["id", 5]]
UPDATE "books" SET "books_total" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["books_total", 612], ["updated_at", "2020-02-19 09:37:51.021311"], ["id", 2]]
---
  def reduce_book_in_db
    book_cards.each do |book_card|
      book = book_card.book
      book_stock = book.books_total - 1

      if book_stock >= 1
        book.update_columns(:books_total => book_stock, :status => 1)
      else
        book.update_columns(:books_total => 0, :status => 0)