app/models/book_order.rb

SELECT "book_cards".* FROM "book_cards" WHERE (book_order_id = 3)
---
    def reduce_book_in_db
        book_order = BookOrder.last.id
        book_cards = BookCard.where("book_order_id = #{book_order}")